#include <iostream>
#include <cstdlib> // Для використання функції system("pause")
#include <Windows.h> // Для використання функції Beep

using namespace std;

// Функція для обробки випадку "u"
void s_calculation() {
    cout << "Виклик функції s_calculation()" << endl;
    // Ваш код для обробки випадку "u" тут
}

// Функція для обробки випадку "о"
void task_9_1() {
    cout << "Виклик функції задачі 9.1" << endl;
    // Ваш код для обробки випадку "о" тут
}

// Функція для обробки випадку "p"
void task_9_2() {
    cout << "Виклик функції задачі 9.2" << endl;
    // Ваш код для обробки випадку "p" тут
}

// Функція для обробки випадку "a"
void task_9_3() {
    cout << "Виклик функції задачі 9.3" << endl;
    // Ваш код для обробки випадку "a" тут
}

int main() {
    char choice;
    do {
        cout << "Введіть символ ('u', 'o', 'p', 'a') або 's' для завершення: ";
        cin >> choice;

        switch (choice) {
            case 'u':
                s_calculation();
                break;
            case 'o':
                task_9_1();
                break;
            case 'p':
                task_9_2();
                break;
            case 'a':
                task_9_3();
                break;
            case 's':
            case 'S':
                return 0; // Вихід з програми
            default:
                // Якщо введений символ не відповідає жодному з варіантів, відтворюємо звуковий сигнал помилки
                Beep(1000, 500); // Перший параметр - частота звуку (в герцах), другий - тривалість (в мілісекундах)
                cout << "Помилкове введення. Спробуйте ще раз." << endl;
        }
    } while (true);

    //system("pause"); // Використовуйте цей рядок, якщо ви використовуєте Windows і хочете зупинити консоль перед завершенням
    return 0;
}
